# Lab 1
### Learning outcomes 
Upon successful completion of this lab, you will have demonstrated the abilities to: 
1.	Loading a dataset into a pandas dataframe
2.	Counting how many rows and columns were loaded
3.	Determining which type of data was loaded
4.	Looking at different parts of the data by subsetting rows and columns
5.	Working with Data Series

#### Before you start
Load the diabetes dataset

## Run this cell, look at the output for each command to make sure you understand the purpose of each command
from sklearn.datasets import load_diabetes
import pandas as pd

diabetes=load_diabetes()
print(diabetes.keys())
print(diabetes.DESCR)
print(diabetes.feature_names) # these are the column names
# attach the feature names to the data as column names
df=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)

In [32]:
from sklearn.datasets import load_diabetes 
import pandas as pd
diabetes = load_diabetes()
print(diabetes.keys())
print(diabetes.DESCR)
print(diabetes.feature_names) # these are the column names
# attach the feature names to the data as column names
df=pd.DataFrame(diabetes.data, columns=diabetes.feature_names)

dict_keys(['data', 'target', 'frame', 'DESCR', 'feature_names', 'data_filename', 'target_filename', 'data_module'])
.. _diabetes_dataset:

Diabetes dataset
----------------

Ten baseline variables, age, sex, body mass index, average blood
pressure, and six blood serum measurements were obtained for each of n =
442 diabetes patients, as well as the response of interest, a
quantitative measure of disease progression one year after baseline.

**Data Set Characteristics:**

:Number of Instances: 442

:Number of Attributes: First 10 columns are numeric predictive values

:Target: Column 11 is a quantitative measure of disease progression one year after baseline

:Attribute Information:
    - age     age in years
    - sex
    - bmi     body mass index
    - bp      average blood pressure
    - s1      tc, total serum cholesterol
    - s2      ldl, low-density lipoproteins
    - s3      hdl, high-density lipoproteins
    - s4      tch, total cholesterol / HDL
    - s5      ltg, possibly log of serum triglycerides level
    - s6      glu, blood sugar level

Note: Each of these 10 feature variables have been mean centered and scaled by the standard deviation times the square root of `n_samples` (i.e. the sum of squares of each column totals 1).

Source URL:
https://www4.stat.ncsu.edu/~boos/var.select/diabetes.html

For more information see:
Bradley Efron, Trevor Hastie, Iain Johnstone and Robert Tibshirani (2004) "Least Angle Regression," Annals of Statistics (with discussion), 407-499.
(https://web.stanford.edu/~hastie/Papers/LARS/LeastAngle_2002.pdf)

['age', 'sex', 'bmi', 'bp', 's1', 's2', 's3', 's4', 's5', 's6']

1. print the number of rows and columns in the dataset using the shape attribute of the dataframe object

In [3]:
print(df.shape)

(442, 10)

2. print the first 5 observations of the dataset.

In [ ]:
print(df.head(5))

,age,sex,bmi,bp,s1,s2,s3,s4,s5,s6
0,0.038076,0.050680,0.061696,0.021872,-0.044223,-0.034821,-0.043401,-0.002592,0.019907,-0.017646
1,-0.001882,-0.044642,-0.051474,-0.026328,-0.008449,-0.019163,0.074412,-0.039493,-0.068332,-0.092204
2,0.085299,0.050680,0.044451,-0.005670,-0.045599,-0.034194,-0.032356,-0.002592,0.002861,-0.025930
3,-0.089063,-0.044642,-0.011595,-0.036656,0.012191,0.024991,-0.036038,0.034309,0.022688,-0.009362
4,0.005383,-0.044642,-0.036385,0.021872,0.003935,0.015596,0.008142,-0.002592,-0.031988,-0.046641

3. print the column names of the dataset

In [5]:
print(df.columns.values)

['age' 'sex' 'bmi' 'bp' 's1' 's2' 's3' 's4' 's5' 's6']

4. get the dtype of each column

In [6]:
df.dtypes

age    float64
sex    float64
bmi    float64
bp     float64
s1     float64
s2     float64
s3     float64
s4     float64
s5     float64
s6     float64
dtype: object

5. use loc to show the second row of the dataset.

In [7]:
df.loc[1]

age   -0.001882
sex   -0.044642
bmi   -0.051474
bp    -0.026328
s1    -0.008449
s2    -0.019163
s3     0.074412
s4    -0.039493
s5    -0.068332
s6    -0.092204
Name: 1, dtype: float64

6. use loc to show the second, 100th and 150th rows of the dataset

In [ ]:
df.loc[[1,99,149]]

          age       sex       bmi        bp        s1        s2        s3  \
1   -0.001882 -0.044642 -0.051474 -0.026328 -0.008449 -0.019163  0.074412
99  -0.001882 -0.044642 -0.064408  0.011544  0.027326  0.037517 -0.013948
149 -0.049105  0.050680 -0.005128 -0.046985 -0.020832 -0.020416 -0.069172

           s4        s5        s6
1   -0.039493 -0.068332 -0.092204
99   0.034309  0.011785 -0.054925
149  0.071210  0.061238 -0.038357

7. use iloc to show the the second and 100th rows of the dataset

In [9]:
df.iloc[[1,99]]

         age       sex       bmi        bp        s1        s2        s3  \
1  -0.001882 -0.044642 -0.051474 -0.026328 -0.008449 -0.019163  0.074412
99 -0.001882 -0.044642 -0.064408  0.011544  0.027326  0.037517 -0.013948

          s4        s5        s6
1  -0.039493 -0.068332 -0.092204
99  0.034309  0.011785 -0.054925

8. use loc to show the bmi column of the dataset

In [10]:
df.loc[:,'bmi']

0      0.061696
1     -0.051474
2      0.044451
3     -0.011595
4     -0.036385
         ...
437    0.019662
438   -0.015906
439   -0.015906
440    0.039062
441   -0.073030
Name: bmi, Length: 442, dtype: float64

9. Use loc to show the bmi, bp columns of the dataset

In [11]:
df.loc[:,['bmi','bp']]

          bmi        bp
0    0.061696  0.021872
1   -0.051474 -0.026328
2    0.044451 -0.005670
3   -0.011595 -0.036656
4   -0.036385  0.021872
..        ...       ...
437  0.019662  0.059744
438 -0.015906 -0.067642
439 -0.015906  0.017293
440  0.039062  0.001215
441 -0.073030 -0.081413

[442 rows x 2 columns]

10. use iloc to show the last row of the dataset

In [12]:
df.iloc[-1]

age   -0.045472
sex   -0.044642
bmi   -0.073030
bp    -0.081413
s1     0.083740
s2     0.027809
s3     0.173816
s4    -0.039493
s5    -0.004222
s6     0.003064
Name: 441, dtype: float64

11. Use iloc to show the last two observations of the dataset

In [13]:
df.iloc[-2:]

          age       sex       bmi        bp        s1        s2        s3  \
440 -0.045472 -0.044642  0.039062  0.001215  0.016318  0.015283 -0.028674
441 -0.045472 -0.044642 -0.073030 -0.081413  0.083740  0.027809  0.173816

           s4        s5        s6
440  0.026560  0.044529 -0.025930
441 -0.039493 -0.004222  0.003064

12. use loc to create a subset of the first 10 obs for age,bmi,bp columns. Then show the first 5 obs of the subset dataframe.

In [37]:
ten_obs_df = df.loc[:9,["age","bmi","bp"]]
ten_obs_df.head(5)

        age       bmi        bp
0  0.038076  0.061696  0.021872
1 -0.001882 -0.051474 -0.026328
2  0.085299  0.044451 -0.005670
3 -0.089063 -0.011595 -0.036656
4  0.005383 -0.036385  0.021872

13. Use iloc and slicing columns method with colon (:) to slice the first 6 columns of the dataset)keep all rows). Save the sliced subset in dataframe subset, then show the first 5 obs of dataframe subset.

In [15]:
sliced_df_1 = df.iloc[:,:6]
sliced_df_1.head(5)

        age       sex       bmi        bp        s1        s2
0  0.038076  0.050680  0.061696  0.021872 -0.044223 -0.034821
1 -0.001882 -0.044642 -0.051474 -0.026328 -0.008449 -0.019163
2  0.085299  0.050680  0.044451 -0.005670 -0.045599 -0.034194
3 -0.089063 -0.044642 -0.011595 -0.036656  0.012191  0.024991
4  0.005383 -0.044642 -0.036385  0.021872  0.003935  0.015596

14. slice columns 3 to 5 inclusive into dataframe subset. then show the first 5 obs of dataframe subset.

In [16]:
sliced_df_2 = df.loc[:,df.columns[2:5]]
sliced_df_2.head(5)

        bmi        bp        s1
0  0.061696  0.021872 -0.044223
1 -0.051474 -0.026328 -0.008449
2  0.044451 -0.005670 -0.045599
3 -0.011595 -0.036656  0.012191
4 -0.036385  0.021872  0.003935

15. use iloc and slice every other column up to 5 inclusive into a dataframe subset. Then show the first 5 obs of the dataframe subset.

In [29]:
sliced_df_3 = df.iloc[:,:6:2]
sliced_df_3.head(5)

   AGE   BMI   S1
0   59  32.1  157
1   48  21.6  183
2   72  30.5  156
3   24  25.3  198
4   50  23.0  192

16. Use loc to display the age for the 10th row of the dataframe.

In [18]:
sliced_df_4 = df.loc[9,"age"]
sliced_df_4

np.float64(-0.07090024709715959)

17. Use loc to display the bmi for row numbers 100, 200 and 300.

In [19]:
sliced_df_5 = df.loc[[100,200,300],"bmi"]
sliced_df_5

100    0.017506
200   -0.057941
300    0.073552
Name: bmi, dtype: float64

In [20]:
url = "https://www4.stat.ncsu.edu/~boos/var.select/diabetes.tab.txt"
# Import the data into a DataFrame
df = pd.read_csv(url, sep='\t')
df

     AGE  SEX   BMI      BP   S1     S2    S3    S4      S5   S6    Y
0     59    2  32.1  101.00  157   93.2  38.0  4.00  4.8598   87  151
1     48    1  21.6   87.00  183  103.2  70.0  3.00  3.8918   69   75
2     72    2  30.5   93.00  156   93.6  41.0  4.00  4.6728   85  141
3     24    1  25.3   84.00  198  131.4  40.0  5.00  4.8903   89  206
4     50    1  23.0  101.00  192  125.4  52.0  4.00  4.2905   80  135
..   ...  ...   ...     ...  ...    ...   ...   ...     ...  ...  ...
437   60    2  28.2  112.00  185  113.8  42.0  4.00  4.9836   93  178
438   47    2  24.9   75.00  225  166.0  42.0  5.00  4.4427  102  104
439   60    2  24.9   99.67  162  106.6  43.0  3.77  4.1271   95  132
440   36    1  30.0   95.00  201  125.2  42.0  4.79  5.1299   85  220
441   36    1  19.6   71.00  250  133.2  97.0  3.00  4.5951   92   57

[442 rows x 11 columns]

18. use loc to display the data where age>50.

In [21]:
df.loc[df["AGE"]>50]

     AGE  SEX   BMI      BP   S1     S2    S3    S4      S5   S6    Y
0     59    2  32.1  101.00  157   93.2  38.0  4.00  4.8598   87  151
2     72    2  30.5   93.00  156   93.6  41.0  4.00  4.6728   85  141
7     66    2  26.2  114.00  255  185.0  56.0  4.55  4.2485   92   63
8     60    2  32.1   83.00  179  119.4  42.0  4.00  4.4773   94  110
11    56    2  28.0   85.00  184  144.8  32.0  6.00  3.5835   77   69
..   ...  ...   ...     ...  ...    ...   ...   ...     ...  ...  ...
431   68    2  23.5  101.00  162   85.4  59.0  3.00  4.4773   91   66
432   51    1  31.5   93.00  231  144.0  49.0  4.70  5.2523  117  173
434   53    1  26.5   97.00  193  122.4  58.0  3.00  4.1431   99   49
437   60    2  28.2  112.00  185  113.8  42.0  4.00  4.9836   93  178
439   60    2  24.9   99.67  162  106.6  43.0  3.77  4.1271   95  132

[215 rows x 11 columns]

19. use loc to display only bmi and bp for the females only.

In [ ]:
# I considered 2 as female.
df.loc[df["SEX"]==2,["BMI","BP"]]

      BMI      BP
0    32.1  101.00
2    30.5   93.00
6    22.0   90.00
7    26.2  114.00
8    32.1   83.00
..    ...     ...
428  34.6  120.00
431  23.5  101.00
437  28.2  112.00
438  24.9   75.00
439  24.9   99.67

[207 rows x 2 columns]

20. Get a series of age column from the dataframe object.

In [23]:
df["AGE"]

0      59
1      48
2      72
3      24
4      50
       ..
437    60
438    47
439    60
440    36
441    36
Name: AGE, Length: 442, dtype: int64

21. print the min, max and mean values for the age series.

In [24]:
print(f"minimum age ==> {df["AGE"].min()}")
print(f"maximum age ==> {df["AGE"].max()}")
print(f"mean age ==> {df["AGE"].mean()}")

minimum age ==> 19
maximum age ==> 79
mean age ==> 48.51809954751131

22.print the basic information about age series

In [25]:
print(df["AGE"].describe())

count    442.000000
mean      48.518100
std       13.109028
min       19.000000
25%       38.250000
50%       50.000000
75%       59.000000
max       79.000000
Name: AGE, dtype: float64

23.print the subset of ages that are less than mean age value

In [26]:
print(df[df["AGE"]<df["AGE"].mean()])

     AGE  SEX   BMI    BP   S1     S2    S3    S4      S5   S6    Y
1     48    1  21.6  87.0  183  103.2  70.0  3.00  3.8918   69   75
3     24    1  25.3  84.0  198  131.4  40.0  5.00  4.8903   89  206
5     23    1  22.6  89.0  139   64.8  61.0  2.00  4.1897   68   97
6     36    2  22.0  90.0  160   99.6  50.0  3.00  3.9512   82  138
9     29    1  30.0  85.0  180   93.4  43.0  4.00  5.3845   88  310
..   ...  ...   ...   ...  ...    ...   ...   ...     ...  ...  ...
435   45    1  24.2  83.0  177  118.4  45.0  4.00  4.2195   82   64
436   33    1  19.5  80.0  171   85.4  75.0  2.00  3.9703   80   48
438   47    2  24.9  75.0  225  166.0  42.0  5.00  4.4427  102  104
440   36    1  30.0  95.0  201  125.2  42.0  4.79  5.1299   85  220
441   36    1  19.6  71.0  250  133.2  97.0  3.00  4.5951   92   57

[202 rows x 11 columns]

24.Sort the age series and print sorted values.

In [27]:
sorted_df = df.sort_values(by="AGE",ascending=True)
sorted_df

     AGE  SEX   BMI      BP   S1     S2    S3    S4      S5   S6    Y
26    19    1  19.2   87.00  124   54.0  57.0  2.00  4.1744   90  137
374   19    1  23.2   75.00  143   70.4  52.0  3.00  4.6347   72  140
344   19    1  25.3   83.00  225  156.6  46.0  5.00  4.7185   84  200
242   20    2  24.2   88.00  126   72.2  45.0  3.00  3.7842   74   71
226   20    2  22.1   87.00  171   99.6  58.0  3.00  4.2047   78   77
..   ...  ...   ...     ...  ...    ...   ...   ...     ...  ...  ...
211   74    1  29.8  101.00  171  104.8  50.0  3.00  4.3944   86   70
311   75    1  30.1   78.00  222  154.2  44.0  5.05  4.7791   97  180
321   75    1  31.2  117.67  229  138.8  29.0  7.90  5.7236  106  230
204   79    2  27.0  103.00  169  110.8  37.0  5.00  4.6634  110  277
402   79    2  23.3   88.00  186  128.4  33.0  6.00  4.8122  102  168

[442 rows x 11 columns]

25.print all the unique values from the age series.

In [28]:
print(df["AGE"].unique())

[59 48 72 24 50 23 36 66 60 29 22 56 53 61 34 47 68 38 41 35 25 31 30 19
 42 63 67 32 58 57 62 52 46 21 54 33 27 37 65 39 40 20 44 49 43 64 55 51
 28 45 26 71 79 74 69 70 75 73]